benchmarks/results_qwen3_5_35b_dequant_perf/trace_baseline.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a7c983449a0>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='custom', no_stream=False, dataset_path='/workspace/vllm-turboquant/calibration/prompts/qwen_agent_qwen3_5_35b.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=128, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='/workspace/hf-cache/models--Qwen--Qwen3.5-35B-A3B/snapshots/ec2d4ece1ffb563322cbee9a48fe0e3fcbce0307', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/vllm-turboquant/benchmarks/results_qwen3_5_35b_dequant_perf', result_filename='bench_baseline.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-1fd5457c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 64/64 [00:32<00:00,  1.97it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  32.50     
Total input tokens:                      262144    
Total generated tokens:                  8192      
Request throughput (req/s):              1.97      
Output token throughput (tok/s):         252.03    
Peak output token throughput (tok/s):    258.00    
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          8316.99   
---------------Time to First Token----------------
Mean TTFT (ms):                          220.07    
Median TTFT (ms):                        224.95    
P99 TTFT (ms):                           279.60    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.26      
Median TPOT (ms):                        6.22      
P99 TPOT (ms):                           6.44      
---------------Inter-token Latency----------------
Mean ITL (ms):                           6.26      
Median ITL (ms):                         6.18      
P99 ITL (ms):                            7.26      
==================================================